Documents/УДАЛИТЬ_ВходящийКонтакт.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.21">
	<Document>
		<Properties>
			<Name>УДАЛИТЬ_ВходящийКонтакт</Name>
			<Comment>Входящий контакт</Comment>
			<Posting>Allow</Posting>
			<RegisterRecords>
				<xr:Item>InformationRegister.ВходящиеКонтакты</xr:Item>
				<xr:Item>AccumulationRegister.КонверсияВходящихКонтактов</xr:Item>
			</RegisterRecords>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>РекламныйИсточник</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.РекламныеИсточники</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Потребность</Name>
					<Comment>Потребность, с которой клиент к нам обратился</Comment>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Результат</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.РезультатыКонтактов</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Автор</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Пользователи</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ВидКонтакта</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ВидыКонтактов</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>РекламнаяАкция</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.РекламнаяАкция</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Предложение</Name>
					<Comment>То, что мы предложили клиенту по его потребности</Comment>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ИмяКлиента</Name>
					<Comment>Имя клиента, от которого произошло обращение</Comment>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>255</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>СотовыйТелефонКлиента</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>20</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ПрочиеТелефоныКлиента</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>255</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ЭлектроннаяПочтаКлиента</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>255</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ПояснениеРезультатаВходящегоКонтакта</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ПоясненияРезультатаВходящегоКонтакта</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ТочкаПродаж</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ТочкиПродаж</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ЭлектроннаяПочтаАдрес</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ЭлектроннаяПочтаИД</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
		</ChildObjects>
	</Document>
</MetaDataObject>

Documents/УДАЛИТЬ_ВходящийКонтакт/Forms/ФормаДокумента/Ext/Form/Module.bsl
//ПРОЦЕДУРЫ И ФУНКЦИИ НА СЕРВЕРЕ БЕЗ КОНТЕКСТА
&НаСервереБезКонтекста
Функция ВидКонтактаНачалоВыбораНаСервере()
	
	МассивРезультат = Новый Массив;
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
	"ВЫБРАТЬ РАЗРЕШЕННЫЕ
	|	ВидыКонтактов.Ссылка
	|ИЗ
	|	Справочник.ВидыКонтактов КАК ВидыКонтактов
	|ГДЕ
	|	ВидыКонтактов.ПометкаУдаления = ЛОЖЬ";
	
	Результат = Запрос.Выполнить().Выбрать();
	Пока Результат.Следующий() Цикл
		МассивРезультат.Добавить(Результат.Ссылка);
	КонецЦикла;
	
	Возврат МассивРезультат;
	
КонецФункции

&НаСервереБезКонтекста
Функция РекламнаяАкцияНачалоВыбораНаСервере()
	
	МассивРезультат = Новый Массив;
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
	"ВЫБРАТЬ РАЗРЕШЕННЫЕ
	|	РекламнаяАкция.Ссылка КАК Ссылка
	|ИЗ
	|	Справочник.РекламнаяАкция КАК РекламнаяАкция
	|ГДЕ
	|	РекламнаяАкция.ПометкаУдаления = ЛОЖЬ";
	
	Результат = Запрос.Выполнить().Выбрать();
	Пока Результат.Следующий() Цикл
		МассивРезультат.Добавить(Результат.Ссылка);
	КонецЦикла;
	
	Возврат МассивРезультат;
	
КонецФункции

&НаСервереБезКонтекста
Функция ПолучитьРезультатОтказ()
	
	Возврат Справочники.РезультатыКонтактов.Отказ
	
КонецФункции

&НаСервереБезКонтекста
Функция ПолучитьРезультатЗамер()
	
	Возврат Справочники.РезультатыКонтактов.Замер
	
КонецФункции

&НаСервереБезКонтекста
Функция ПолучитьРезультатПерезвонить()
	
	Возврат Справочники.РезультатыКонтактов.Перезвонить
	
КонецФункции

&НаСервереБезКонтекста
Функция ПолучитьРезультатПрочее()
	
	Возврат Справочники.РезультатыКонтактов.Прочее;
	
КонецФункции

&НаСервереБезКонтекста
Функция ПолучитьСписокПоясненийРезультата()
	
	Результат = Новый СписокЗначений;
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
	"ВЫБРАТЬ РАЗРЕШЕННЫЕ
	|	ПоясненияРезультатаВходящегоКонтакта.Ссылка
	|ИЗ
	|	Справочник.ПоясненияРезультатаВходящегоКонтакта КАК ПоясненияРезультатаВходящегоКонтакта
	|ГДЕ
	|	ПоясненияРезультатаВходящегоКонтакта.ПометкаУдаления = ЛОЖЬ";
	
	РезультатЗапроса = Запрос.Выполнить().Выбрать();
	Пока РезультатЗапроса.Следующий() Цикл
		Результат.Добавить(РезультатЗапроса.Ссылка);
	КонецЦикла;
	
	Возврат Результат;
	
КонецФункции

//ПРОЦЕДУРЫ И ФУНКЦИИ НА СЕРВЕРЕ
&НаСервере
Процедура ВызватьПроведениеДокумента()
	Объект.Ссылка.ПолучитьОбъект().Записать(РежимЗаписиДокумента.Проведение);
КонецПроцедуры

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	Если Параметры.Ключ.Пустая() Тогда
		ОбщийМодуль.ЗаполнитьШапкуДокумента(Объект);
		
		Если Параметры.ТочкаПродаж.Пустая() Тогда
			Объект.ТочкаПродаж = Справочники.Пользователи.НайтиПоНаименованию(СокрЛП(ИмяПользователя())).ТочкаПродаж;
		Иначе
			Объект.ТочкаПродаж = Параметры.ТочкаПродаж;
		КонецЕсли;
		
		Объект.СотовыйТелефонКлиента = Параметры.СотовыйТелефонКлиента;
		Объект.ВидКонтакта = Параметры.ВидКонтакта;
	Иначе
		ЭтаФорма.ТолькоПросмотр = ПраваПользователей.ДокументТолькоПросмотр(Объект.Ссылка);
	КонецЕсли;
	
	ПраваПользователей.УстановитьТолькоПросмотрДляРеквизитаНомер(Элементы.Номер.ТолькоПросмотр);
	
КонецПроцедуры

&НаСервере
Функция ПолучитьСсылкуНаОбъект()
	Возврат Объект.Ссылка;
КонецФункции

//ПРОЦЕДУРЫ И ФУНКЦИИ НА КЛИЕНТЕ
&НаКлиенте
Процедура Замер(Команда)
	
	Если ПроверитьЗаполнение() Тогда
		Объект.Результат = ПолучитьРезультатЗамер();
		Объект.ПояснениеРезультатаВходящегоКонтакта = "";
		ЭтаФорма.Записать();
		ВызватьПроведениеДокумента();
	
		ПараметрыЗамера = Новый Структура("Основание", ПолучитьСсылкуНаОбъект());
		ФормаЗамера = ПолучитьФорму("Документ.Замер.ФормаОбъекта",ПараметрыЗамера);
		ФормаЗамера.Открыть();
	
		ЭтаФорма.Закрыть();
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура ВыборРезультатаОтказ(ВыбранныйЭлемент, ДополнительныеПараметры) Экспорт 
	Попытка
		Объект.Результат = ПолучитьРезультатОтказ();
		Объект.ПояснениеРезультатаВходящегоКонтакта = ВыбранныйЭлемент.Значение;
		ЭтаФорма.Записать();
		ВызватьПроведениеДокумента();
		ЭтаФорма.Закрыть();
	Исключение
		Сообщить(ОписаниеОшибки());
	КонецПопытки;
КонецПроцедуры

&НаКлиенте
Процедура ВыборРезультатаПерезвонить(ВыбранныйЭлемент, ДополнительныеПараметры) Экспорт 
	
КонецПроцедуры

&НаКлиенте
Процедура ВидКонтактаНачалоВыбора(Элемент, ДанныеВыбора, СтандартнаяОбработка)
	
	СтандартнаяОбработка = ЛОЖЬ;
	ДанныеВыбора = Новый СписокЗначений;
	МассивВыбора = ВидКонтактаНачалоВыбораНаСервере();
	
	Для Ном = 0 По МассивВыбора.Количество() - 1 Цикл
		ДанныеВыбора.Добавить(МассивВыбора[Ном]);
	КонецЦикла;
	
КонецПроцедуры

&НаКлиенте
Процедура ВидКонтактаОбработкаВыбора(Элемент, ВыбранноеЗначение, СтандартнаяОбработка)
	ВидКонтакта = ВыбранноеЗначение;
КонецПроцедуры

&НаКлиенте
Процедура РекламнаяАкцияНачалоВыбора(Элемент, ДанныеВыбора, СтандартнаяОбработка)
	
	СтандартнаяОбработка = ЛОЖЬ;
	ДанныеВыбора = Новый СписокЗначений;
	МассивВыбора = РекламнаяАкцияНачалоВыбораНаСервере();
	
	Для Ном = 0 По МассивВыбора.Количество() - 1 Цикл
		ДанныеВыбора.Добавить(МассивВыбора[Ном]);
	КонецЦикла;
	
КонецПроцедуры

&НаКлиенте
Процедура РекламнаяАкцияОбработкаВыбора(Элемент, ВыбранноеЗначение, СтандартнаяОбработка)
	РекламнаяАкция = ВыбранноеЗначение;
КонецПроцедуры

&НаКлиенте
Процедура Перезвонить(Команда)
	
	Если ПроверитьЗаполнение() Тогда
		СписокВариантов = ПолучитьСписокПоясненийРезультата();
		Если СписокВариантов = Неопределено Тогда
			Состояние("Ошибка получения пояснений результата контакта");
			Возврат;
		КонецЕсли;
		Если СписокВариантов.Количество() = 0 Тогда
			Состояние("Не заполнен справочник пояснений результата контакта. Документ не записан");
			Возврат;
		КонецЕсли;
		
		Оп = Новый ОписаниеОповещения("ВыборРезультатаПерезвонить", ЭтаФорма);
		ПоказатьВыборИзМеню(Оп, СписокВариантов, Элементы.Перезвонить);
	КонецЕсли
	
КонецПроцедуры

&НаКлиенте
Процедура Отказ(Команда)
	
	Если ПроверитьЗаполнение() Тогда
		СписокВариантов = ПолучитьСписокПоясненийРезультата();
		Если СписокВариантов = Неопределено Тогда
			Состояние("Ошибка получения списка причин отказа");
			Возврат;
		КонецЕсли;
		Если СписокВариантов.Количество() = 0 Тогда
			Состояние("Не заполнен справочник причин отказа. Документ не записан");
			Возврат;
		КонецЕсли;
		
		Оп = Новый ОписаниеОповещения("ВыборРезультатаОтказ", ЭтаФорма);
		ПоказатьВыборИзМеню(Оп, СписокВариантов, Элементы.Отказ);
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура ПоказатьГрафикЗамеров(Команда)
	
	ПараметрыОтчета = Новый Структура;
	ПараметрыОтчета.Вставить("ДатаНачала", НачалоДня(ТекущаяДата()));
	ПараметрыОтчета.Вставить("ДатаОкончания", НачалоДня(ТекущаяДата())+60*60*24*7);
		
	ОткрытьФорму("Отчет.ГрафикЗамеров.Форма.ФормаОтчета", ПараметрыОтчета);
	
КонецПроцедуры

&НаКлиенте
Процедура Прочее(Команда)
	
	Если ПроверитьЗаполнение() Тогда
		Объект.Результат = ПолучитьРезультатПрочее();
		//Объект.ПояснениеРезультатаВходящегоКонтакта = "";
		ЭтаФорма.Записать();
		ВызватьПроведениеДокумента();
		ЭтаФорма.Закрыть();
	КонецЕсли;
	
КонецПроцедуры


&НаСервере
Процедура ПриЧтенииНаСервере(ТекущийОбъект)
	ДатыЗапретаИзменения.ОбъектПриЧтенииНаСервере(ЭтотОбъект, ТекущийОбъект);
КонецПроцедуры
